In [1]:
import pandas as pd
import numpy as np

- 판다스의 가장 간단한 데이터형인 Series
- index와 value를 가질 수 있으며 한가지 데이터형만 허용

In [2]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

- date_range로 날짜(시간)을 이용할 수 있다
- periods는 며칠간인지를 지정

In [3]:
dates = pd.date_range("20130101",periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

- 판다스에서 가장 많이 사용하는 데이터형인 dataframe
- index와 columns, value로 구성된다.
- np.random.randn은 표준정규분포에서 샘플링한 난수 생성

- 잠깐 팁! 함수 괄호 안에서 shift+tab을 누르면 docstring에서 함수 사용법을 볼 수 있다

In [4]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=["A","B","C","D"])
df

                   A         B         C         D
2013-01-01 -1.118612  0.895325 -0.827811  0.383771
2013-01-02  0.553093  0.198350  0.187422  0.992559
2013-01-03 -1.188205  2.142953  0.498369 -0.843841
2013-01-04 -0.862822 -1.444000 -1.883338 -0.109346
2013-01-05  0.423908  0.612416  0.204110  0.650571
2013-01-06 -0.707264  1.037168  0.581143 -0.012005

In [5]:
df.head()
df.tail()
df.index # 인덱스만 봄
df.columns #컬럼만 봄
df.values #값만 봄
df.info #인포 요약해서 봄

<bound method DataFrame.info of                    A         B         C         D
2013-01-01 -1.118612  0.895325 -0.827811  0.383771
2013-01-02  0.553093  0.198350  0.187422  0.992559
2013-01-03 -1.188205  2.142953  0.498369 -0.843841
2013-01-04 -0.862822 -1.444000 -1.883338 -0.109346
2013-01-05  0.423908  0.612416  0.204110  0.650571
2013-01-06 -0.707264  1.037168  0.581143 -0.012005>

In [6]:
df.describe() # 기술통계정보 확인

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.483317  0.573702 -0.206684  0.176951
std    0.773543  1.182734  0.963204  0.646837
min   -1.188205 -1.444000 -1.883338 -0.843841
25%   -1.054664  0.301867 -0.574003 -0.085011
50%   -0.785043  0.753871  0.195766  0.185883
75%    0.141115  1.001707  0.424804  0.583871
max    0.553093  2.142953  0.581143  0.992559

- sort_values를 이용해 데이터 정렬

In [9]:
df.sort_values(by="A") #기본적으로 오름차순

                   A         B         C         D
2013-01-03 -1.188205  2.142953  0.498369 -0.843841
2013-01-01 -1.118612  0.895325 -0.827811  0.383771
2013-01-04 -0.862822 -1.444000 -1.883338 -0.109346
2013-01-06 -0.707264  1.037168  0.581143 -0.012005
2013-01-05  0.423908  0.612416  0.204110  0.650571
2013-01-02  0.553093  0.198350  0.187422  0.992559

In [11]:
df.sort_values(by="B",ascending=False, inplace=True) # false는 내림차순

In [12]:
#한 개 컬럼 선택
df["A"]

2013-01-03   -1.188205
2013-01-06   -0.707264
2013-01-01   -1.118612
2013-01-05    0.423908
2013-01-02    0.553093
2013-01-04   -0.862822
Name: A, dtype: float64

In [13]:
type(df["A"])

pandas.core.series.Series

- 문자열로 이름 쓰면 아래와 같은 형태로 불러올 수 있음

In [14]:
df.D

2013-01-03   -0.843841
2013-01-06   -0.012005
2013-01-01    0.383771
2013-01-05    0.650571
2013-01-02    0.992559
2013-01-04   -0.109346
Name: D, dtype: float64

- 두 개 이상 열 불러올 때는 리스트에 넣기

In [15]:
df[["A","B"]]

                   A         B
2013-01-03 -1.188205  2.142953
2013-01-06 -0.707264  1.037168
2013-01-01 -1.118612  0.895325
2013-01-05  0.423908  0.612416
2013-01-02  0.553093  0.198350
2013-01-04 -0.862822 -1.444000

- [n:m]: n부터 m-1까지 
- 인덱스나 컬럼의 이름으로 slice 하는 경우는 그 이름까지 끝을 포함

In [16]:
df[0:3]

                   A         B         C         D
2013-01-03 -1.188205  2.142953  0.498369 -0.843841
2013-01-06 -0.707264  1.037168  0.581143 -0.012005
2013-01-01 -1.118612  0.895325 -0.827811  0.383771

In [17]:
df["20210101":"20210104"]

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_37924\2286221099.py:1: FutureWarning: Value based partial slicing on non-monotonic DatetimeIndexes with non-existing keys is deprecated and will raise a KeyError in a future Version.
  df["20210101":"20210104"]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [20]:
df.sort_index(inplace=True)

In [21]:
df

                   A         B         C         D
2013-01-01 -1.118612  0.895325 -0.827811  0.383771
2013-01-02  0.553093  0.198350  0.187422  0.992559
2013-01-03 -1.188205  2.142953  0.498369 -0.843841
2013-01-04 -0.862822 -1.444000 -1.883338 -0.109346
2013-01-05  0.423908  0.612416  0.204110  0.650571
2013-01-06 -0.707264  1.037168  0.581143 -0.012005

In [23]:
df["20130101":"20130104"]

                   A         B         C         D
2013-01-01 -1.118612  0.895325 -0.827811  0.383771
2013-01-02  0.553093  0.198350  0.187422  0.992559
2013-01-03 -1.188205  2.142953  0.498369 -0.843841
2013-01-04 -0.862822 -1.444000 -1.883338 -0.109346

- loc: location
- index 이름으로 특정 행, 열을 선택합니다

In [24]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -1.118612  0.895325
2013-01-02  0.553093  0.198350
2013-01-03 -1.188205  2.142953
2013-01-04 -0.862822 -1.444000
2013-01-05  0.423908  0.612416
2013-01-06 -0.707264  1.037168

In [25]:
df.loc["20130101":"20130104",["A","B"]]

                   A         B
2013-01-01 -1.118612  0.895325
2013-01-02  0.553093  0.198350
2013-01-03 -1.188205  2.142953
2013-01-04 -0.862822 -1.444000

- iloc : inter location
- 컴퓨터가 인식하는 인덱스 값으로 선택

In [27]:
df.iloc[3]

A   -0.862822
B   -1.444000
C   -1.883338
D   -0.109346
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
df.iloc[3,2]

-1.883337666457799

In [29]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.862822 -1.444000
2013-01-05  0.423908  0.612416

## condition

In [30]:
# A 컬럼에서 0보다 큰 숫자(양수)만 선택
df["A"]>0

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06    False
Name: A, dtype: bool

In [31]:
df[df["A"]>0]

                   A         B         C         D
2013-01-02  0.553093  0.198350  0.187422  0.992559
2013-01-05  0.423908  0.612416  0.204110  0.650571

In [32]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.895325       NaN  0.383771
2013-01-02  0.553093  0.198350  0.187422  0.992559
2013-01-03       NaN  2.142953  0.498369       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05  0.423908  0.612416  0.204110  0.650571
2013-01-06       NaN  1.037168  0.581143       NaN

In [36]:
df["E"]=["one","one","two","three","four","five"]  
df

                   A     B         C         D      E
2013-01-01 -1.118612   one -0.827811  0.383771    one
2013-01-02  0.553093   one  0.187422  0.992559    one
2013-01-03 -1.188205   two  0.498369 -0.843841    two
2013-01-04 -0.862822  tree -1.883338 -0.109346  three
2013-01-05  0.423908  four  0.204110  0.650571   four
2013-01-06 -0.707264  five  0.581143 -0.012005   five

In [37]:
df

                   A     B         C         D      E
2013-01-01 -1.118612   one -0.827811  0.383771    one
2013-01-02  0.553093   one  0.187422  0.992559    one
2013-01-03 -1.188205   two  0.498369 -0.843841    two
2013-01-04 -0.862822  tree -1.883338 -0.109346  three
2013-01-05  0.423908  four  0.204110  0.650571   four
2013-01-06 -0.707264  five  0.581143 -0.012005   five

- isin()
- 특정요소가 있나요? 확인

In [39]:
df[df["E"].isin(["two","five","three"])]

                   A     B         C         D      E
2013-01-03 -1.188205   two  0.498369 -0.843841    two
2013-01-04 -0.862822  tree -1.883338 -0.109346  three
2013-01-06 -0.707264  five  0.581143 -0.012005   five

- 특정 컬럼 제외

In [40]:
del df["E"]
df

                   A     B         C         D
2013-01-01 -1.118612   one -0.827811  0.383771
2013-01-02  0.553093   one  0.187422  0.992559
2013-01-03 -1.188205   two  0.498369 -0.843841
2013-01-04 -0.862822  tree -1.883338 -0.109346
2013-01-05  0.423908  four  0.204110  0.650571
2013-01-06 -0.707264  five  0.581143 -0.012005

- axis=0 은 가로고, 1은 세로로 데이터를 지운다

In [42]:
df.drop(["D"],axis=1)

                   A     B         C
2013-01-01 -1.118612   one -0.827811
2013-01-02  0.553093   one  0.187422
2013-01-03 -1.188205   two  0.498369
2013-01-04 -0.862822  tree -1.883338
2013-01-05  0.423908  four  0.204110
2013-01-06 -0.707264  five  0.581143

In [43]:
df.drop(["20130101"])

                   A     B         C         D
2013-01-02  0.553093   one  0.187422  0.992559
2013-01-03 -1.188205   two  0.498369 -0.843841
2013-01-04 -0.862822  tree -1.883338 -0.109346
2013-01-05  0.423908  four  0.204110  0.650571
2013-01-06 -0.707264  five  0.581143 -0.012005

- apply

In [44]:
df["A"].apply("sum")

-2.8999010437550496

In [45]:
df["A"].apply("mean")

-0.4833168406258416

In [46]:
df["A"].apply("max")

0.5530933018745549

In [47]:
df["A"].apply(np.sum)

2013-01-01   -1.118612
2013-01-02    0.553093
2013-01-03   -1.188205
2013-01-04   -0.862822
2013-01-05    0.423908
2013-01-06   -0.707264
Name: A, dtype: float64

In [48]:
df["A"].apply(np.mean)

2013-01-01   -1.118612
2013-01-02    0.553093
2013-01-03   -1.188205
2013-01-04   -0.862822
2013-01-05    0.423908
2013-01-06   -0.707264
Name: A, dtype: float64

In [49]:
df["A"].apply(np.std) #표준편차

2013-01-01    0.0
2013-01-02    0.0
2013-01-03    0.0
2013-01-04    0.0
2013-01-05    0.0
2013-01-06    0.0
Name: A, dtype: float64

In [50]:
df.apply(np.sum)

A                -2.899901
B    oneonetwotreefourfive
C                -1.240105
D                 1.061708
dtype: object

In [51]:
def plusmius(num):
    return "plus" if num > 0 else "minus"

In [52]:
df["A"].apply(plusmius)

2013-01-01    minus
2013-01-02     plus
2013-01-03    minus
2013-01-04    minus
2013-01-05     plus
2013-01-06    minus
Name: A, dtype: object

In [53]:
df["A"].apply(lambda num: "plus" if num >0 else "minus")

2013-01-01    minus
2013-01-02     plus
2013-01-03    minus
2013-01-04    minus
2013-01-05     plus
2013-01-06    minus
Name: A, dtype: object